---

#  How to merge two dataframes with different lengths and with different data types?


---

In [1]:
# This allows multiple outputs from a single jupyter notebook cell:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
%matplotlib inline
import pandas as pd

In [3]:
import mplfinance as mpf
mpf.__version__

'0.12.7a17'

In [4]:
cols=['people_id',  'people-desc',  'people_code',  'ranking']
rows = [[      23455,      'large',        4567,           15],
      [67889,      'small',        234,            23],
      [88903,      'tiny',         678,            14],
      [23379,      'big',          380,            34],
      [36888,      'petite',       344,            76],
      [23441,      'crazy',        341,            88]]

In [5]:
df1 = pd.DataFrame(rows)
df1.columns = cols
df1

   people_id people-desc  people_code  ranking
0      23455       large         4567       15
1      67889       small          234       23
2      88903        tiny          678       14
3      23379         big          380       34
4      36888      petite          344       76
5      23441       crazy          341       88

In [6]:
cols = ['people-rate',  'people_workco',   'people_height', 'people_id']
rows = [[   233,           5788,             1.6,           36888], 
   [678,           7889,             1.9,           23379],
   [231,           3568,             1.5,           88903]]
df2 = pd.DataFrame(rows)
df2.columns = cols
df2

   people-rate  people_workco  people_height  people_id
0          233           5788            1.6      36888
1          678           7889            1.9      23379
2          231           3568            1.5      88903

In [7]:
cols = ['people-rate',  'people_workco',    'people_height',  'people_id',  'people-desc',  'people_code',    'ranking']
rows = [[ 233,           5788,             1.6,           36888,     'petite',       344,            76],
     [678,           7889,             1.9,           23379,     'big',          380,            34],
     [231,           3568,            1.5,           88903 ,     'tiny',          678,            14]]
df3 = pd.DataFrame(rows)
df3.columns = cols
df3

,people-rate,people_workco,people_height,people_id,people-desc,people_code,ranking
0,233,5788,1.6,36888,petite,344,76
1,678,7889,1.9,23379,big,380,34
2,231,3568,1.5,88903,tiny,678,14

In [8]:
dfm = df2.merge(df1, on='people_id')

In [9]:
dfm

,people-rate,people_workco,people_height,people_id,people-desc,people_code,ranking
0,233,5788,1.6,36888,petite,344,76
1,678,7889,1.9,23379,big,380,34
2,231,3568,1.5,88903,tiny,678,14

In [10]:
dfm == df3

,people-rate,people_workco,people_height,people_id,people-desc,people_code,ranking
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True